import React from 'react'
import ReportCard from './ReportCard'

const MyReports = () => {
    const [showModal, setShowModal] = React.useState(false)

    return (
        <>
            <ReportCard/>
            <button onClick={() => setShowModal(!showModal)} id="openModal" className="bg-[#79B937] text-white py-2 px-4 rounded">Сподели</button>

            <div id="modal"
                className={`modal ${showModal ? '' : 'hidden'} fixed inset-0 flex items-center justify-center bg-[#aeaeae]/[0.68] px-[16px]`}>
                <div className="modal-content w-full rounded-[20px] bg-white relative flex justify-center flex-col items-center pb-[70px]"
                    style={{ boxShadow: '0px 4px 15px 0px rgba(0, 0, 0, 0.15)' }}>
                    <span onClick={() => setShowModal(!showModal)} id="closeModal" className="close absolute top-[21px] right-[21px] text-2xl cursor-pointer flex justify-end">
                        <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                            xmlns="http://www.w3.org/2000/svg" className="w-[30px] h-[30px]" preserveAspectRatio="none">
                            <g filter="url(#filter0_di_1297_5446)">
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M14.9999 16.7675L22.0712 23.8388C22.3069 24.0664 22.6227 24.1924 22.9504 24.1896C23.2781 24.1867 23.5917 24.0553 23.8234 23.8235C24.0552 23.5918 24.1866 23.2782 24.1895 22.9505C24.1923 22.6228 24.0663 22.307 23.8386 22.0713L16.7674 15L23.8386 7.92875C24.0663 7.693 24.1923 7.37725 24.1895 7.0495C24.1866 6.72176 24.0552 6.40824 23.8234 6.17648C23.5917 5.94472 23.2781 5.81326 22.9504 5.81041C22.6227 5.80756 22.3069 5.93356 22.0712 6.16125L14.9999 13.2325L7.92865 6.16125C7.69184 5.93918 7.37792 5.81796 7.05331 5.82323C6.72871 5.8285 6.41889 5.95986 6.18941 6.1895C5.95993 6.41914 5.8288 6.72905 5.82376 7.05366C5.81872 7.37826 5.94016 7.6921 6.1624 7.92875L13.2324 15L6.16115 22.0713C6.04176 22.1866 5.94654 22.3245 5.88102 22.477C5.81551 22.6295 5.78103 22.7935 5.77959 22.9595C5.77815 23.1255 5.80977 23.2901 5.87262 23.4437C5.93548 23.5973 6.02829 23.7369 6.14566 23.8542C6.26302 23.9716 6.40259 24.0644 6.55621 24.1273C6.70983 24.1901 6.87443 24.2218 7.0404 24.2203C7.20638 24.2189 7.3704 24.1844 7.52291 24.1189C7.67541 24.0534 7.81334 23.9581 7.92865 23.8388L14.9999 16.7675Z"
                                    fill="#CCCECF"></path>
                            </g>
                            <defs>
                                <filter id="filter0_di_1297_5446" x="-9.22046" y="-7.18964" width="48.4099" height="48.41"
                                    filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                    <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
                                    <feColorMatrix in="SourceAlpha" type="matrix"
                                        values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"></feColorMatrix>
                                    <feOffset dy="2"></feOffset>
                                    <feGaussianBlur stdDeviation="7.5"></feGaussianBlur>
                                    <feComposite in2="hardAlpha" operator="out"></feComposite>
                                    <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.15 0">
                                    </feColorMatrix>
                                    <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_1297_5446">
                                    </feBlend>
                                    <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_1297_5446"
                                        result="shape"></feBlend>
                                    <feColorMatrix in="SourceAlpha" type="matrix"
                                        values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"></feColorMatrix>
                                    <feOffset dy="1"></feOffset>
                                    <feGaussianBlur stdDeviation="0.5"></feGaussianBlur>
                                    <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1">
                                    </feComposite>
                                    <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0">
                                    </feColorMatrix>
                                    <feBlend mode="normal" in2="shape" result="effect2_innerShadow_1297_5446"></feBlend>
                                </filter>
                            </defs>
                        </svg>
                    </span>
                    <svg width="56" height="56" viewBox="0 0 56 56" fill="none"
                        xmlns="http://www.w3.org/2000/svg" className="w-14 h-14 relative mt-[43px] mb-[31px]"
                        preserveAspectRatio="xMidYMid meet">
                        <g clip-path="url(#clip0_1297_5471)">
                            <path
                                d="M24.5997 55.79C19.6052 55.1425 14.4637 53.0005 10.7187 50.0027C2.28719 43.2757 -1.54007 32.648 0.647435 22.0937C1.58543 17.5367 4.02844 12.7417 7.15569 9.28724C9.45938 6.69462 12.2375 4.56633 15.3404 3.01699C19.4599 0.929241 23.3974 -0.00875854 28.0454 -0.00875854C31.3809 -0.00875854 34.0619 0.428741 37.1332 1.47699C41.168 2.86097 44.8336 5.14783 47.8505 8.16328C50.8675 11.1787 53.1562 14.8431 54.5422 18.8772C56.1837 23.6897 56.4829 28.812 55.4347 33.8887C54.5964 37.8997 52.4352 42.4112 49.7752 45.6732C48.6814 47.0225 46.1649 49.4287 44.8437 50.4035C40.891 53.3391 36.2423 55.1954 31.3547 55.79C29.9144 55.972 25.9927 55.9632 24.5997 55.79ZM32.2297 53.4485C39.0517 52.3051 45.1402 48.4986 49.1557 42.8662C53.8859 36.2215 55.1529 27.307 52.4824 19.5335C51.8542 17.71 50.2949 14.6667 49.1557 13.062C47.8887 11.2665 44.7527 8.12174 42.9484 6.85474C41.1984 5.61574 38.2182 4.11074 36.1847 3.44574C32.514 2.22624 28.6163 1.84707 24.7794 2.33626C20.9426 2.82544 17.2647 4.17048 14.0174 6.27199C10.9622 8.27893 8.35062 10.8905 6.34368 13.9457C4.24271 17.1912 2.89793 20.8674 2.40874 24.7024C1.91955 28.5375 2.29845 32.4335 3.51743 36.1025C4.19118 38.1342 5.69618 41.125 6.92643 42.875C8.20218 44.6705 11.3382 47.8152 13.1337 49.0822C14.7472 50.2127 17.7817 51.7702 19.6052 52.409C23.6639 53.7879 28 54.145 32.2297 53.4485ZM22.5312 44.0597C21.2228 43.8625 19.9676 43.4036 18.8404 42.7105C17.8289 42.063 10.1902 34.58 9.81744 33.8782C9.38869 33.0767 10.1359 31.6172 11.2034 31.171L11.7039 30.961L10.1639 29.393C9.31694 28.5267 8.51369 27.6062 8.38593 27.3507C8.08494 26.768 8.07619 25.5185 8.35793 24.962C8.47694 24.7345 8.75869 24.388 8.97744 24.1955C9.35194 23.8857 9.38694 23.7755 9.35193 22.9915C9.30643 22.2985 9.36944 22.0255 9.67043 21.5057C10.1079 20.7585 11.0109 20.2562 11.8947 20.2475C12.3864 20.2475 12.5142 20.1845 12.7242 19.8187C13.2719 18.8615 14.8382 18.515 16.0334 19.0995L16.6809 19.4092L16.9994 19.0995C17.4369 18.6987 18.3119 18.3435 18.8859 18.3435C20.0339 18.3435 21.6562 19.6647 21.6562 20.594C21.6562 21.7052 20.6447 21.8977 19.6419 20.9772C18.9769 20.3577 18.6392 20.293 18.3662 20.7305C18.2297 20.9405 18.5569 21.3325 20.5169 23.31C22.4769 25.2787 22.8322 25.6987 22.8322 26.0715C22.8167 26.3572 22.6951 26.6268 22.4911 26.8276C22.2872 27.0283 22.0156 27.1456 21.7297 27.1565C21.3744 27.1565 20.7917 26.6455 18.1019 23.9662C15.3579 21.231 14.8574 20.7935 14.6387 20.9317C14.0454 21.3062 14.2467 21.5792 17.4544 24.7957C19.1957 26.5457 20.6272 28.0945 20.6272 28.2415C20.6272 28.5425 20.3542 29.099 20.1267 29.2442C19.9401 29.3262 19.737 29.3639 19.5334 29.3545C19.1589 29.3632 18.5849 28.8435 15.5329 25.8002C12.4704 22.7552 11.9227 22.2635 11.7039 22.4C11.1019 22.7832 11.3032 23.0475 14.7944 26.5562C16.7002 28.462 18.2944 30.1665 18.3399 30.3485C18.4397 30.6775 18.2209 31.2515 17.9304 31.451C17.7377 31.533 17.529 31.5706 17.3197 31.5612C16.9452 31.5612 16.4727 31.1517 13.9474 28.6265C11.5132 26.1922 10.9479 25.6917 10.6382 25.7197C9.76319 25.8195 10.0729 26.2115 14.5932 30.7422C18.5132 34.671 19.0137 35.2275 19.0137 35.637C19.0176 35.7873 18.9838 35.9363 18.9153 36.0702C18.8469 36.2041 18.7459 36.3187 18.6217 36.4035C17.9199 36.96 17.6469 36.8322 15.8777 35.119C14.9747 34.2527 14.0454 33.4145 13.7987 33.2587C13.3524 32.9857 12.2219 32.8667 12.0119 33.0855C11.9384 33.1485 13.6062 34.909 15.7132 36.995C19.2219 40.467 19.6227 40.824 20.6534 41.3157C21.603 41.7886 22.6488 42.0361 23.7095 42.0392C24.7703 42.0422 25.8174 41.8006 26.7697 41.3332C29.7132 39.9297 31.3459 36.5207 30.5427 33.4302C30.1419 31.8902 29.6397 31.1517 27.6167 29.064C25.2839 26.6752 24.7449 26.019 24.1709 24.871C23.5322 23.5865 23.2592 22.337 23.2592 20.7777C23.2592 19.0907 23.4324 18.326 24.1797 16.7492C24.8902 15.246 26.3759 13.6692 27.8442 12.8572C30.7247 11.2525 34.5169 11.389 37.2679 13.1862C37.8157 13.5415 39.7932 15.4017 42.2537 17.871C45.9094 21.5355 46.3277 22.0097 46.3277 22.428C46.3277 23.422 45.5157 24.5245 44.6144 24.752C44.2767 24.843 44.3414 24.934 45.8727 26.4932C46.7652 27.3962 47.5947 28.371 47.7224 28.672C48.1512 29.7027 47.9587 30.7037 47.1747 31.5245C46.7739 31.9445 46.7197 32.0897 46.7092 32.928C46.7004 33.6665 46.6182 33.9762 46.3259 34.3962C46.0951 34.7379 45.786 35.0195 45.4244 35.2177C45.0628 35.4158 44.6591 35.5248 44.2469 35.5355C43.6817 35.5355 43.5732 35.5897 43.2897 36.0185C42.6509 37.0037 40.9919 37.3485 39.9174 36.7115L39.3802 36.393L38.9969 36.7675C38.1499 37.5795 36.7814 37.688 35.7437 37.023C34.9054 36.4945 34.2859 35.756 34.2859 35.2905C34.2859 34.881 34.8792 34.2055 35.2432 34.2055C35.5897 34.2055 36.0552 34.4785 36.5837 34.972C37.1122 35.4725 37.5689 35.4725 37.6407 34.9632C37.6774 34.6902 37.2399 34.1705 35.4707 32.3925C33.6104 30.5147 33.2552 30.086 33.2552 29.722C33.251 29.5188 33.2885 29.3169 33.3654 29.1287C33.5667 28.8277 34.1319 28.6177 34.4767 28.7087C34.6587 28.7542 36.1987 30.177 37.8857 31.8622C39.5814 33.558 41.0672 34.9422 41.2037 34.9422C41.5782 34.9422 41.8232 34.5677 41.6499 34.2492C41.5677 34.104 40.1362 32.6357 38.4772 30.9767C35.8802 28.3885 35.4602 27.9055 35.4602 27.5222C35.4517 27.3159 35.4893 27.1102 35.5704 26.9202C35.7262 26.6927 36.2722 26.4197 36.5819 26.4197C36.7184 26.4197 38.4317 28.014 40.3917 29.9652C43.9827 33.5387 44.2469 33.7382 44.6214 33.1467C44.7579 32.928 44.2662 32.3715 41.2212 29.3177C38.0764 26.1642 37.6582 25.69 37.6582 25.2805C37.6582 24.9987 37.7859 24.7065 37.9872 24.5245C38.6522 23.8962 38.8534 24.024 42.0892 27.2405C45.1517 30.2942 45.4247 30.4937 45.7992 29.911C45.9357 29.6922 45.3162 29.0185 41.5152 25.207C37.3764 21.0507 37.0772 20.713 37.0772 20.23C37.0772 19.5002 37.4972 19.1537 38.3074 19.2097C38.4527 19.2185 39.3277 19.957 40.2307 20.8407C41.1424 21.7245 42.1259 22.554 42.4182 22.6817C42.9922 22.918 43.6572 22.9547 43.9407 22.7727C44.2137 22.5995 36.6484 15.1532 35.6649 14.6335C34.8217 14.1784 33.8942 13.9006 32.9395 13.8174C31.9849 13.7341 31.0233 13.8471 30.114 14.1494C29.2047 14.4517 28.3668 14.9369 27.652 15.5751C26.9372 16.2133 26.3606 16.9911 25.9577 17.8605C25.4834 18.872 25.4204 19.173 25.3557 20.4767C25.3014 21.707 25.3469 22.0902 25.6112 22.8742C26.0854 24.269 26.4949 24.843 28.6194 27.013C30.9172 29.365 31.3547 29.9022 31.9374 31.1605C33.5789 34.6605 32.8859 38.7082 30.1787 41.405C28.1189 43.4735 25.3119 44.4412 22.5312 44.0597Z"
                                fill="#79B937"></path>
                        </g>
                        <defs>
                            <clipPath id="clip0_1297_5471">
                                <rect width="56" height="56" fill="white"></rect>
                            </clipPath>
                        </defs>
                    </svg>
                    <div className="w-[314px] flex flex-col items-center">
                        <p className="text-base font-semibold text-[#343a40]">
                            Сподели и зголеми го импактот
                        </p>
                        <p className="text-sm font-medium text-center text-[#343a40]">
                            Повикај ги пријателите да ја поддржат твојата иницијатива за почист воздух
                        </p>
                    </div>
                    <div className="top-[42px] flex justify-between w-full pt-[42px] px-[42px]">
                        <div className="w-14 h-14 rounded-[10px] bg-white flex justify-center items-center"
                            style={{ boxShadow: '0px 4px 4px 0 rgba(0,0,0,0.25)' }}>
                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none"
                                xmlns="http://www.w3.org/2000/svg" className="w-12 h-[47.71px] relative"
                                preserveAspectRatio="xMidYMid meet">
                                <g clip-path="url(#clip0_1297_5455)" filter="url(#filter0_i_1297_5455)">
                                    <path
                                        d="M48 24C48 35.9787 39.2249 45.9093 27.7511 47.7084V30.9369H33.344L34.4071 24H27.7511V19.4987C27.7511 17.6 28.6791 15.7511 31.6622 15.7511H34.688V9.84533C34.688 9.84533 31.9431 9.376 29.3156 9.376C23.8329 9.376 20.2489 12.6969 20.2489 18.7129V24H14.1582V30.9369H20.2489V47.7084C8.77867 45.9093 0 35.9787 0 24C0 10.7449 10.7449 0 24 0C37.2551 0 48 10.7449 48 24Z"
                                        fill="#343A40"></path>
                                </g>
                                <defs>
                                    <filter id="filter0_i_1297_5455" x="0" y="0" width="48" height="48.7084"
                                        filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                        <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
                                        <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape">
                                        </feBlend>
                                        <feColorMatrix in="SourceAlpha" type="matrix"
                                            values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha">
                                        </feColorMatrix>
                                        <feOffset dy="1"></feOffset>
                                        <feGaussianBlur stdDeviation="0.5"></feGaussianBlur>
                                        <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1">
                                        </feComposite>
                                        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0">
                                        </feColorMatrix>
                                        <feBlend mode="normal" in2="shape" result="effect1_innerShadow_1297_5455">
                                        </feBlend>
                                    </filter>
                                    <clipPath id="clip0_1297_5455">
                                        <rect width="48" height="47.7084" fill="white"></rect>
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                        <div className="w-14 h-14 rounded-[10px] bg-white flex justify-center items-center"
                            style={{ boxShadow: "0px 4px 4px 0 rgba(0,0,0,0.25)" }}>
                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none"
                                xmlns="http://www.w3.org/2000/svg" className="w-12 h-12 relative"
                                preserveAspectRatio="xMidYMid meet">
                                <g clip-path="url(#clip0_1297_5459)">
                                    <g filter="url(#filter0_i_1297_5459)">
                                        <path
                                            d="M29.0346 24C29.0346 26.7804 26.7803 29.0347 23.9999 29.0347C21.2194 29.0347 18.9617 26.7804 18.9617 24C18.9617 21.2196 21.2159 18.9618 23.9999 18.9618C26.7839 18.9618 29.0346 21.216 29.0346 24Z"
                                            fill="#343A40"></path>
                                    </g>
                                    <g filter="url(#filter1_i_1297_5459)">
                                        <path
                                            d="M36.2987 17.8916C36.2311 16.4196 35.9858 15.6196 35.7796 15.0862C35.5058 14.3822 35.1787 13.8773 34.6489 13.3511C34.1191 12.8213 33.6178 12.4942 32.9102 12.2204C32.3769 12.0107 31.5769 11.7653 30.1049 11.6978C28.512 11.6267 28.032 11.6124 24 11.6124C19.968 11.6124 19.4844 11.6267 17.8916 11.6978C16.4196 11.7653 15.6196 12.0107 15.0862 12.2204C14.3822 12.4942 13.8773 12.8213 13.3476 13.3511C12.8213 13.8773 12.4942 14.3822 12.2204 15.0862C12.0107 15.6196 11.7653 16.4196 11.6978 17.8916C11.6267 19.488 11.6089 19.9644 11.6089 24C11.6089 28.0356 11.6267 28.512 11.6978 30.1049C11.7653 31.5804 12.0107 32.3804 12.2204 32.9102C12.4942 33.6178 12.8213 34.1191 13.3476 34.6489C13.8773 35.1787 14.3822 35.5058 15.0862 35.7796C15.6196 35.9858 16.4196 36.2311 17.8916 36.2987C19.4844 36.3733 19.9644 36.3876 24 36.3876C28.0356 36.3876 28.512 36.3733 30.1049 36.2987C31.5769 36.2311 32.3769 35.9858 32.9102 35.7796C33.6178 35.5058 34.1191 35.1787 34.6489 34.6489C35.1787 34.1191 35.5058 33.6178 35.7796 32.9102C35.9858 32.3804 36.2311 31.5804 36.2987 30.1049C36.3733 28.512 36.3876 28.0356 36.3876 24C36.3876 19.9644 36.3733 19.488 36.2987 17.8916ZM24 31.7582C19.712 31.7582 16.2382 28.2844 16.2382 24C16.2382 19.7156 19.712 16.2382 24 16.2382C28.288 16.2382 31.7582 19.712 31.7582 24C31.7582 28.288 28.2844 31.7582 24 31.7582ZM32.064 17.7458C31.0649 17.7458 30.2507 16.9351 30.2507 15.9324C30.2507 14.9298 31.0649 14.1191 32.064 14.1191C33.0631 14.1191 33.8773 14.9298 33.8773 15.9324C33.8773 16.9351 33.0667 17.7458 32.064 17.7458Z"
                                            fill="#343A40"></path>
                                    </g>
                                    <g filter="url(#filter2_i_1297_5459)">
                                        <path
                                            d="M24 0C10.7449 0 0 10.7449 0 24C0 37.2551 10.7449 48 24 48C37.2551 48 48 37.2551 48 24C48 10.7449 37.2551 0 24 0ZM39.0187 30.2293C38.944 31.8364 38.6916 32.9351 38.3182 33.8987C37.9307 34.8907 37.4151 35.7333 36.5724 36.5724C35.7333 37.4151 34.8907 37.9307 33.8987 38.3182C32.9351 38.6916 31.8364 38.9476 30.2293 39.0187C28.6187 39.0933 28.1031 39.1111 24 39.1111C19.8969 39.1111 19.3813 39.0933 17.7671 39.0187C16.16 38.9476 15.0613 38.6916 14.1013 38.3182C13.1058 37.9307 12.2631 37.4151 11.424 36.5724C10.5849 35.7333 10.0658 34.8907 9.68178 33.8987C9.30844 32.9351 9.05244 31.8364 8.97778 30.2293C8.90667 28.6187 8.88889 28.1031 8.88889 24C8.88889 19.8969 8.90667 19.3813 8.97778 17.7707C9.05244 16.16 9.30844 15.0613 9.68178 14.1013C10.0658 13.1058 10.5849 12.2631 11.424 11.424C12.2631 10.5849 13.1058 10.0693 14.1013 9.68178C15.0613 9.30844 16.16 9.05244 17.7671 8.97778C19.3813 8.90667 19.8933 8.88889 24 8.88889C28.1067 8.88889 28.6187 8.90667 30.2293 8.97778C31.8364 9.05244 32.9351 9.30844 33.8987 9.68178C34.8907 10.0693 35.7333 10.5849 36.5724 11.424C37.4151 12.2631 37.9307 13.1058 38.3182 14.1013C38.6916 15.0613 38.944 16.16 39.0187 17.7707C39.0933 19.3813 39.1111 19.8969 39.1111 24C39.1111 28.1031 39.0933 28.6187 39.0187 30.2293Z"
                                            fill="#343A40"></path>
                                    </g>
                                </g>
                                <defs>
                                    <filter id="filter0_i_1297_5459" x="18.9617" y="18.9618" width="10.073" height="11.0729"
                                        filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                        <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
                                        <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape">
                                        </feBlend>
                                        <feColorMatrix in="SourceAlpha" type="matrix"
                                            values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha">
                                        </feColorMatrix>
                                        <feOffset dy="1"></feOffset>
                                        <feGaussianBlur stdDeviation="0.5"></feGaussianBlur>
                                        <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1">
                                        </feComposite>
                                        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0">
                                        </feColorMatrix>
                                        <feBlend mode="normal" in2="shape" result="effect1_innerShadow_1297_5459">
                                        </feBlend>
                                    </filter>
                                    <filter id="filter1_i_1297_5459" x="11.6089" y="11.6124" width="24.7786" height="25.7751"
                                        filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                        <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
                                        <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape">
                                        </feBlend>
                                        <feColorMatrix in="SourceAlpha" type="matrix"
                                            values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha">
                                        </feColorMatrix>
                                        <feOffset dy="1"></feOffset>
                                        <feGaussianBlur stdDeviation="0.5"></feGaussianBlur>
                                        <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1">
                                        </feComposite>
                                        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0">
                                        </feColorMatrix>
                                        <feBlend mode="normal" in2="shape" result="effect1_innerShadow_1297_5459">
                                        </feBlend>
                                    </filter>
                                    <filter id="filter2_i_1297_5459" x="0" y="0" width="48" height="49"
                                        filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                        <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
                                        <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape">
                                        </feBlend>
                                        <feColorMatrix in="SourceAlpha" type="matrix"
                                            values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha">
                                        </feColorMatrix>
                                        <feOffset dy="1"></feOffset>
                                        <feGaussianBlur stdDeviation="0.5"></feGaussianBlur>
                                        <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1">
                                        </feComposite>
                                        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0">
                                        </feColorMatrix>
                                        <feBlend mode="normal" in2="shape" result="effect1_innerShadow_1297_5459">
                                        </feBlend>
                                    </filter>
                                    <clipPath id="clip0_1297_5459">
                                        <rect width="48" height="48" fill="white"></rect>
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                        <div className="w-14 h-14 rounded-[10px] bg-white flex justify-center items-center"
                            style={{ boxShadow: '0px 4px 4px 0 rgba(0,0,0,0.25)' }}>
                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none"
                                xmlns="http://www.w3.org/2000/svg" className="w-12 h-12 relative"
                                preserveAspectRatio="xMidYMid meet">
                                <g clip-path="url(#clip0_1297_5465)">
                                    <g filter="url(#filter0_i_1297_5465)">
                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                            d="M24 0C10.7449 0 0 10.7484 0 24C0 37.2516 10.7449 48 24 48C37.2551 48 48 37.2551 48 24C48 10.7449 37.2551 0 24 0ZM37.2658 18.8693C37.2764 19.1396 37.2836 19.4169 37.2836 19.6907C37.2836 28.1138 30.8729 37.824 19.1502 37.824C15.552 37.824 12.2027 36.768 9.38311 34.9618C9.88089 35.0187 10.3893 35.0507 10.9013 35.0507C13.888 35.0507 16.6364 34.0302 18.8196 32.32C16.0284 32.2702 13.6747 30.4284 12.864 27.8969C13.2516 27.968 13.6533 28.0107 14.0622 28.0107C14.6453 28.0107 15.2071 27.9324 15.744 27.7867C12.8249 27.2036 10.6311 24.6258 10.6311 21.5396V21.4578C11.4916 21.9342 12.4729 22.2222 13.5182 22.2542C11.808 21.1129 10.6809 19.1609 10.6809 16.9493C10.6809 15.7831 10.9973 14.688 11.5449 13.7458C14.688 17.6036 19.3849 20.1387 24.6791 20.4053C24.5724 19.9396 24.5156 19.4524 24.5156 18.9511C24.5156 15.4347 27.3707 12.5796 30.8871 12.5796C32.7218 12.5796 34.3787 13.3547 35.5413 14.592C36.992 14.3076 38.3538 13.7778 39.5876 13.0453C39.1111 14.5351 38.1013 15.7831 36.7858 16.5724C38.0729 16.416 39.3031 16.0747 40.4444 15.5698C39.5911 16.8462 38.5102 17.9698 37.2658 18.8693Z"
                                            fill="#343A40"></path>
                                    </g>
                                </g>
                                <defs>
                                    <filter id="filter0_i_1297_5465" x="0" y="0" width="48" height="49"
                                        filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                        <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
                                        <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape">
                                        </feBlend>
                                        <feColorMatrix in="SourceAlpha" type="matrix"
                                            values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha">
                                        </feColorMatrix>
                                        <feOffset dy="1"></feOffset>
                                        <feGaussianBlur stdDeviation="0.5"></feGaussianBlur>
                                        <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1">
                                        </feComposite>
                                        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0">
                                        </feColorMatrix>
                                        <feBlend mode="normal" in2="shape" result="effect1_innerShadow_1297_5465">
                                        </feBlend>
                                    </filter>
                                    <clipPath id="clip0_1297_5465">
                                        <rect width="48" height="48" fill="white"></rect>
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                        <div className="w-14 h-14 rounded-[10px] bg-white flex justify-center items-center"
                            style={{ boxShadow: "0px 4px 4px 0 rgba(0,0,0,0.25)" }}>
                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none"
                                xmlns="http://www.w3.org/2000/svg" className="w-12 h-12 relative"
                                preserveAspectRatio="xMidYMid meet">
                                <g clip-path="url(#clip0_1297_5469)">
                                    <g filter="url(#filter0_i_1297_5469)">
                                        <path
                                            d="M24 0C10.7449 0 0 10.7449 0 24C0 37.2551 10.7449 48 24 48C37.2551 48 48 37.2551 48 24C48 10.7449 37.2551 0 24 0ZM16.0782 37.1129C14.3716 37.0951 12.6649 37.0987 10.9582 37.1129C10.6844 37.1129 10.6027 37.0453 10.6027 36.7609C10.6098 30.6773 10.6098 24.5938 10.6027 18.5102C10.6027 18.2578 10.6631 18.1689 10.9333 18.1689C12.6649 18.1796 14.3964 18.1831 16.128 18.1689C16.4622 18.1653 16.5049 18.2933 16.5049 18.5778C16.4978 21.6071 16.5013 24.6364 16.5013 27.6658C16.5013 30.6951 16.4942 33.6782 16.5084 36.6827C16.5084 37.0169 16.4267 37.1164 16.0782 37.1129ZM13.5609 15.5627C11.7013 15.5662 10.1582 14.0267 10.1511 12.1707C10.144 10.2898 11.6871 8.74667 13.568 8.74667C15.4311 8.74667 16.9707 10.2827 16.9707 12.1387C16.9707 14.0267 15.4418 15.5627 13.5609 15.5627ZM38.592 36.7218C38.592 37.0347 38.5067 37.1129 38.2009 37.1129C36.4907 37.0987 34.784 37.0987 33.0738 37.1129C32.7751 37.1164 32.7111 37.0204 32.7111 36.7396C32.7218 33.5822 32.7218 30.4284 32.7111 27.2747C32.7111 26.4818 32.6613 25.6924 32.4373 24.9244C32.0284 23.5093 31.0151 22.7876 29.5324 22.8658C27.5058 22.9724 26.4533 23.9751 26.1973 26.0338C26.1333 26.528 26.1049 27.0187 26.1049 27.5164C26.1049 30.5813 26.1013 33.6498 26.112 36.7182C26.1156 37.024 26.0373 37.1164 25.7244 37.1129C24.0036 37.0987 22.2862 37.0987 20.5653 37.1129C20.288 37.1129 20.2098 37.0382 20.2098 36.7609C20.2169 30.6844 20.2169 24.6116 20.2098 18.5387C20.2098 18.2364 20.3058 18.1653 20.5902 18.1689C22.2258 18.1796 23.8578 18.1831 25.4933 18.1689C25.792 18.1653 25.8702 18.2613 25.8631 18.5458C25.8489 19.2747 25.8631 20 25.8631 20.7253C26.2578 20.2844 26.5813 19.8329 26.9867 19.4524C28.2311 18.2791 29.7031 17.6853 31.4204 17.7031C32.3662 17.7102 33.3013 17.7778 34.2116 18.0409C36.2951 18.6418 37.504 20.0782 38.08 22.112C38.5138 23.6373 38.5956 25.2053 38.5956 26.7769C38.6027 30.0907 38.5884 33.408 38.5956 36.7218H38.592Z"
                                            fill="#343A40"></path>
                                    </g>
                                </g>
                                <defs>
                                    <filter id="filter0_i_1297_5469" x="0" y="0" width="48" height="49"
                                        filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                        <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
                                        <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape">
                                        </feBlend>
                                        <feColorMatrix in="SourceAlpha" type="matrix"
                                            values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha">
                                        </feColorMatrix>
                                        <feOffset dy="1"></feOffset>
                                        <feGaussianBlur stdDeviation="0.5"></feGaussianBlur>
                                        <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1">
                                        </feComposite>
                                        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0">
                                        </feColorMatrix>
                                        <feBlend mode="normal" in2="shape" result="effect1_innerShadow_1297_5469">
                                        </feBlend>
                                    </filter>
                                    <clipPath id="clip0_1297_5469">
                                        <rect width="48" height="48" fill="white"></rect>
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                    </div>
                </div>
            </div>
        </>
    )
}

export default MyReports

