import React from 'react'

const ReportCard = () => {
  return (
      <div className="px-[16px] mt-[74px]">
          <p className="text-base text-center font-bold uppercase text-[#343a40] mb-[16px]">Мои пријави</p>
          <div className="flex items-center justify-between mb-[37px]">
              <div className="flex items-center gap-[8px]">
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"
                      className="w-6 h-6 relative" preserveAspectRatio="xMidYMid meet">
                      <path
                          d="M21.1431 6.85725H8.57171M6.28599 6.85725H2.85742M21.1431 18.2858H8.57171M6.28599 18.2858H2.85742M15.4289 12.5715H2.85742M21.1431 12.5715H17.7146M7.42885 4.57153C7.73196 4.57153 8.02265 4.69194 8.23697 4.90627C8.4513 5.1206 8.57171 5.41129 8.57171 5.71439V8.0001C8.57171 8.30321 8.4513 8.5939 8.23697 8.80823C8.02265 9.02255 7.73196 9.14296 7.42885 9.14296C7.12575 9.14296 6.83506 9.02255 6.62073 8.80823C6.4064 8.5939 6.28599 8.30321 6.28599 8.0001V5.71439C6.28599 5.41129 6.4064 5.1206 6.62073 4.90627C6.83506 4.69194 7.12575 4.57153 7.42885 4.57153ZM7.42885 16.0001C7.73196 16.0001 8.02265 16.1205 8.23697 16.3348C8.4513 16.5492 8.57171 16.8399 8.57171 17.143V19.4287C8.57171 19.7318 8.4513 20.0225 8.23697 20.2368C8.02265 20.4511 7.73196 20.5715 7.42885 20.5715C7.12575 20.5715 6.83506 20.4511 6.62073 20.2368C6.4064 20.0225 6.28599 19.7318 6.28599 19.4287V17.143C6.28599 16.8399 6.4064 16.5492 6.62073 16.3348C6.83506 16.1205 7.12575 16.0001 7.42885 16.0001ZM16.5717 10.2858C16.8748 10.2858 17.1655 10.4062 17.3798 10.6206C17.5942 10.8349 17.7146 11.1256 17.7146 11.4287V13.7144C17.7146 14.0175 17.5942 14.3082 17.3798 14.5225C17.1655 14.7368 16.8748 14.8572 16.5717 14.8572C16.2686 14.8572 15.9779 14.7368 15.7636 14.5225C15.5493 14.3082 15.4289 14.0175 15.4289 13.7144V11.4287C15.4289 11.1256 15.5493 10.8349 15.7636 10.6206C15.9779 10.4062 16.2686 10.2858 16.5717 10.2858Z"
                          stroke="#343A40" stroke-linecap="round" stroke-linejoin="round"></path>
                  </svg>
                  <p className="text-sm font-medium text-[#343a40]">Филтрирај</p>
              </div>
              <p className="text-sm font-medium text-[#525659]">48 пријави</p>
          </div>
          <div className="flex items-center mb-[13px]">
              <p className="text-sm font-medium text-[#525659]">Статус</p>
              <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg"
                  className="w-3.5 h-3.5 relative" preserveAspectRatio="none">
                  <g clip-path="url(#clip0_1297_5080)">
                      <path
                          d="M3.24329 7.92947L6.99996 11.6667L10.7566 7.92946C10.801 7.89571 10.8375 7.85283 10.8638 7.80372C10.8901 7.75462 10.9056 7.70043 10.9091 7.64483C10.9127 7.58923 10.9042 7.53352 10.8844 7.48147C10.8645 7.42942 10.8337 7.38224 10.794 7.34313C10.7544 7.30402 10.7067 7.27388 10.6544 7.25478C10.6021 7.23567 10.5463 7.22802 10.4907 7.23236C10.4352 7.2367 10.3812 7.25293 10.3325 7.27994C10.2838 7.30695 10.2414 7.34411 10.2083 7.38891L7.38885 10.185L7.38885 2.74558C7.38885 2.64244 7.34788 2.54352 7.27495 2.47059C7.20202 2.39766 7.1031 2.35669 6.99996 2.35669C6.89682 2.35669 6.79791 2.39766 6.72497 2.47059C6.65204 2.54352 6.61107 2.64244 6.61107 2.74558L6.61107 10.185L3.79163 7.38891C3.7184 7.3162 3.61928 7.27555 3.51609 7.27592C3.41289 7.27628 3.31406 7.31762 3.24135 7.39085C3.16864 7.46408 3.12799 7.5632 3.12836 7.6664C3.12872 7.76959 3.17007 7.86842 3.24329 7.94113L3.24329 7.92947Z"
                          fill="#525659"></path>
                  </g>
                  <defs>
                      <clipPath id="clip0_1297_5080">
                          <rect width="14" height="14" fill="white" transform="translate(14 14) rotate(180)">
                          </rect>
                      </clipPath>
                  </defs>
              </svg>
          </div>
          <div id='contianer'>
              <div className="my-[24px] flex gap-[35.5px]">
                  <div className="w-[161.56px] h-[136px]">
                      <img src={require('../../../images/Rectangle 74.png')}
                          className="w-full h-full rounded-[10px] object-cover" />
                  </div>
                  <div className="flex flex-col gap-[19px]">
                      <div className="flex gap-[3.44px] flex-col">
                          <p className="text-base font-semibold text-black">
                              Ул. Варшавска бр.1
                          </p>
                          <p className="text-sm font-medium text-black">Тафталиџе, Скопје</p>
                          <p className="text-sm text-black">07.09.23 Бр.47</p>
                      </div>
                      <div className="flex justify-between">
                          <div className="flex">
                              <p className="text-base font-semibold text-[#525659]">Види статус</p>
                              <svg width="26" height="24" viewBox="0 0 26 24" fill="none"
                                  xmlns="http://www.w3.org/2000/svg" className="w-[25.02px] h-6 relative"
                                  preserveAspectRatio="none">
                                  <path
                                      d="M12.8256 13.172L17.9851 8.222L19.459 9.636L12.8256 16L6.19223 9.636L7.66713 8.222L12.8267 13.172L12.8256 13.172Z"
                                      fill="#525659"></path>
                              </svg>
                          </div>
                          <svg width="26" height="24" viewBox="0 0 26 24" fill="none"
                              xmlns="http://www.w3.org/2000/svg" className="w-[25.02px] h-6 relative"
                              preserveAspectRatio="none">
                              <g clip-path="url(#clip0_1297_5095)">
                                  <path
                                      d="M12.4553 0C19.0829 0 24.4553 5.3724 24.4553 12C24.4553 18.6276 19.0829 24 12.4553 24C5.82772 24 0.455322 18.6276 0.455322 12C0.455322 5.3724 5.82772 0 12.4553 0ZM12.4553 1.674C9.7167 1.674 7.09024 2.76191 5.15374 4.69842C3.21724 6.63492 2.12932 9.26137 2.12932 12C2.12932 14.7386 3.21724 17.3651 5.15374 19.3016C7.09024 21.2381 9.7167 22.326 12.4553 22.326C15.1939 22.326 17.8204 21.2381 19.7569 19.3016C21.6934 17.3651 22.7813 14.7386 22.7813 12C22.7813 9.26137 21.6934 6.63492 19.7569 4.69842C17.8204 2.76191 15.1939 1.674 12.4553 1.674ZM11.3393 6.6972C11.8013 6.6972 12.1757 7.0728 12.1757 7.5348V13.3956H18.0365C18.253 13.4038 18.4579 13.4956 18.6082 13.6516C18.7585 13.8077 18.8424 14.0159 18.8424 14.2326C18.8424 14.4493 18.7585 14.6575 18.6082 14.8136C18.4579 14.9696 18.253 15.0614 18.0365 15.0696H11.3393C11.1172 15.0696 10.9041 14.9814 10.7471 14.8243C10.59 14.6672 10.5017 14.4541 10.5017 14.232V7.536C10.5017 7.0728 10.8761 6.6972 11.3393 6.6972Z"
                                      fill="#EAD410"></path>
                              </g>
                              <defs>
                                  <clipPath id="clip0_1297_5095">
                                      <rect width="25.0159" height="24" fill="white"
                                          transform="translate(0.000244141)"></rect>
                                  </clipPath>
                              </defs>
                          </svg>
                      </div>
                  </div>
              </div>
              <svg width="354" height="2" viewBox="0 0 354 2" fill="none"
                  xmlns="http://www.w3.org/2000/svg" preserveAspectRatio="xMidYMid meet">
                  <path d="M1 1H353" stroke="#CCCCCC" stroke-linecap="round"></path>
              </svg>
          </div>
      </div>
  )
}

export default ReportCard
